src/Reports/ОСМИ_СтатусыДоставок/ОСМИ_СтатусыДоставок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОСМИ_СтатусыДоставок</name>
  <attributes>
    <name>Источник</name>
    <type>
      <types>DocumentRef.ОСМИ_ДинамическаяАкция</types>
      <types>DocumentRef.ОСМИ_ПушРассылка</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ОСМИ_ДатыОбновлений/ОСМИ_ДатыОбновлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОСМИ_ДатыОбновлений</name>
  <resources>
    <name>ПоследнееОбновление</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Карта</name>
    <type>
      <types>CatalogRef.ОСМИ_ЭлектронныеКарты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОСМИ_СоответствиеКарт/ОСМИ_СоответствиеКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОСМИ_СоответствиеКарт</name>
  <resources>
    <name>ОбъектБазы</name>
    <type>
      <types>DefinedType.ОСМИ_ДисконтнаяКарта</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ЭлектроннаяКарта</name>
    <type>
      <types>CatalogRef.ОСМИ_ЭлектронныеКарты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/ОСМИ_СтатусыДоставок/ObjectModule.bsl
Функция ПолучитьСтатусыДоставки(МассивКарт, Дата = Неопределено) Экспорт 
	СписокНаПроверку = МассивКарт;
	Если Дата = Неопределено Тогда 
		Дата = НачалоДня(ТекущаяДата()); 
	КонецЕсли;
	
	// todo - перенести это в фон
	
	Доставки = ОСМИ_РаботаСAPI.ПолучитьСтатусДоставкиПушСообщения(Дата);	
	
	Если Доставки.Успех Тогда
		Рег = РегистрыСведений.ОСМИ_ДатыОбновлений.СоздатьНаборЗаписей();
		Для Каждого Карта из Доставки.Ответ.delivery Цикл
			Справ = Справочники.ОСМИ_ЭлектронныеКарты.НайтиПоКоду(Карта.serialNo); 
			
			Если не Справ = Справочники.ОСМИ_ЭлектронныеКарты.ПустаяСсылка() Тогда
				Стр = рег.Добавить();
				Стр.Карта = Справочники.ОСМИ_ЭлектронныеКарты.НайтиПоКоду(Карта.serialNo);
				Стр.ПоследнееОбновление = Карта.delivered;
				Стр.Активность = Истина;
			КонецЕсли;
		КонецЦикла;
		Рег.Записать(Истина);
	КонецЕсли;
	
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Карта,
	|	ОСМИ_ДатыОбновлений.ПоследнееОбновление КАК ДатаДоставки,
	|	ВЫБОР
	|		КОГДА ОСМИ_ДатыОбновлений.ПоследнееОбновление ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ОСМИ_ДатыОбновлений.ПоследнееОбновление > &Дата
	|	КОНЕЦ КАК СтатусДоставки,
	|	ОСМИ_СоответствиеКарт.ОбъектБазы КАК Карта1С
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОСМИ_ЭлектронныеКарты.Ссылка КАК Ссылка
	|	ИЗ
	|		Справочник.ОСМИ_ЭлектронныеКарты КАК ОСМИ_ЭлектронныеКарты
	|	ГДЕ
	|		ОСМИ_ЭлектронныеКарты.Ссылка В(&МассивКарт)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОСМИ_ДатыОбновлений КАК ОСМИ_ДатыОбновлений
	|		ПО ВложенныйЗапрос.Ссылка = ОСМИ_ДатыОбновлений.Карта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОСМИ_СоответствиеКарт КАК ОСМИ_СоответствиеКарт
	|		ПО ВложенныйЗапрос.Ссылка = ОСМИ_СоответствиеКарт.ЭлектроннаяКарта";
	Запрос.УстановитьПараметр("МассивКарт",МассивКарт);
	Запрос.УстановитьПараметр("Дата",Дата);
	Выб = ЗАпрос.Выполнить().Выгрузить();
			
	Возврат Выб;
	
КонецФункции
